---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementNormalizedSegmentLength
source: html/20cd0737-9374-05a7-7710-56c700306186.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementNormalizedSegmentLength Property

"Normalized Segment Length"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementNormalizedSegmentLength { get; }
```